def area(a, h):
    """
    Возвращает площадь треугольника

            Параметры:
                    a (float): сторона треугольника
                    h (float): высота треугольника

            Возвращаемое значение:
                    a * h / 2 (float): площадь треугольника
    """
    return a * h / 2 


def perimeter(a, b, c):
    """
    Возвращает периметр треугольника

            Параметры:
                    a (float): сторона треугольника
                    b (float): сторона треугольника
                    c (float): сторона треугольника

            Возвращаемое значение:
                    a + b + c (float): периметр треугольника
    """
    return a + b + c 
